app/views/disciplinas/_form.html.erb

SELECT `cursos`.* FROM `cursos`
---
    <%= f.label :curso_id, "Curso" %><br>
    <%= f.collection_select :curso_id, Curso.all, :id, :nome %>

SELECT `funcaos`.* FROM `funcaos`
---
    <%= f.label :funcao_id, "Cargo" %><br>
    <%= f.collection_select :funcao_id, Funcao.all, :id, :cargo %>

SELECT `funcionarios`.* FROM `funcionarios`
---
    <%= f.label :funcionario_id, "Funcionário" %><br>
    <%= f.collection_select :funcionario_id, Funcionario.all, :id, :nome %>

SELECT `alunos`.* FROM `alunos`
---
    <%= f.label :aluno_id, "Aluno" %><br>
    <%= f.collection_select :aluno_id, Aluno.all, :id, :nome, prompt: "Selecione" %>