app/views/turmas/_form.html.erb

SELECT `disciplinas`.* FROM `disciplinas`
---
    <%= f.label :disciplina_id %><br>
    <%= f.collection_select :disciplina_id, Disciplina.all, :id, :nome %>

SELECT `alunos`.* FROM `alunos`
---
    <%= f.label :aluno_id %><br>
    <%= f.collection_select :aluno_id, Aluno.all, :id, :nome %>