app/views/alunos/_form.html.erb

    <%= f.label :user_id, "E-mail" %><br>
    <%= f.collection_select :user_id, User.all, :id, :email, prompt: "Selecione" %>
---
SELECT `users`.* FROM `users`