app/controllers/alunos_controller.rb

SELECT COUNT(*) FROM `alunos`
SELECT `alunos`.* FROM `alunos`
---
  def index
    @alunos = Aluno.all.page(params['page']).per(5)

INSERT INTO `alunos` (`nome`, `matricula`, `endereco`, `user_id`, `nascimento`, `data_cadast`, `created_at`, `updated_at`) VALUES ('Aryanne Nara', 1003, 'Rua Cinderela, 70', 3, '2011-12-14', '2016-05-09', '2016-05-09 22:06:41', '2016-05-09 22:06:41')
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

SELECT  `alunos`.* FROM `alunos` WHERE `alunos`.`id` = 1 LIMIT 1
---
    def set_aluno
      @aluno = Aluno.find(params[:id])