app/controllers/cursos_controller.rb

SELECT `cursos`.* FROM `cursos`
---
  def index
    @cursos = Curso.all

INSERT INTO `cursos` (`nome`, `codigo`, `duracao`, `tipo`, `created_at`, `updated_at`) VALUES ('Sistema deInformação', 'TI010', '4 anos', 'Bacharelado', '2016-05-11 00:44:31', '2016-05-11 00:44:31')
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save

UPDATE `cursos` SET `nome` = 'Sistema de Informação', `updated_at` = '2016-05-11 01:13:48' WHERE `cursos`.`id` = 1
---
  def update
    respond_to do |format|
      if @curso.update(curso_params)

DELETE FROM `cursos` WHERE `cursos`.`id` = 3
---
  def destroy
    @curso.destroy

SELECT  `cursos`.* FROM `cursos` WHERE `cursos`.`id` = 3 LIMIT 1
---
    def set_curso
      @curso = Curso.find(params[:id])