app/controllers/disciplinas_controller.rb

  def index
    @disciplinas = Disciplina.all
---
SELECT `disciplinas`.* FROM `disciplinas`

  def create
    @disciplina = Disciplina.new(disciplina_params)

    respond_to do |format|
      if @disciplina.save
---
INSERT INTO `disciplinas` (`nome`, `codigo`, `curso_id`, `funcao_id`, `funcionario_id`, `created_at`, `updated_at`) VALUES ('Desenvolvimento de software', 10, 1, 4, 2, '2016-05-11 22:58:05', '2016-05-11 22:58:05')

    def set_disciplina
      @disciplina = Disciplina.find(params[:id])
---
SELECT  `disciplinas`.* FROM `disciplinas` WHERE `disciplinas`.`id` = 1 LIMIT 1