app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all.page(params['page']).per(5)
---
SELECT  `funcionarios`.* FROM `funcionarios` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `funcionarios`

  def show
    @funcionario = Funcionario.find(params[:id])
---
SELECT  `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`id` = 2 LIMIT 1

  def create
    #@funcionario = Funcionario.find(params[:funcionario_id])

    @funcionario = Funcionario.new(funcionario_params)
    #@funcao = @funcionario.funcao.create(params[:funcao_cargo])
    #@user = @funcionario.users.create(params[:user_email])
    respond_to do |format|
      if @funcionario.save
---
INSERT INTO `funcionarios` (`nome`, `matricula`, `user_email`, `endereco`, `funcao_cargo`, `user_id`, `funcao_id`, `nascimento`, `admissao`, `created_at`, `updated_at`) VALUES ('Jean Lima', 1, 1, 'Rua Sagrada Familia', 1, 1, 1, '2011-02-09', '2016-05-08', '2016-05-08 01:05:28', '2016-05-08 01:05:28')

  def update
    respond_to do |format|
      if @funcionario.update(funcionario_params)
---
UPDATE `funcionarios` SET `endereco` = 'Rua Sagrada Familia', `updated_at` = '2016-05-11 00:20:29' WHERE `funcionarios`.`id` = 1

    def set_funcionario
      @funcionario = Funcionario.find(params[:id])
---
SELECT  `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`id` = NULL LIMIT 1