app/controllers/funcaos_controller.rb

SELECT `funcaos`.* FROM `funcaos`
---
  def index
    @funcaos = Funcao.all

INSERT INTO `funcaos` (`cargo`, `created_at`, `updated_at`) VALUES ('administrador', '2016-05-08 01:06:21', '2016-05-08 01:06:21')
---
  def create
    @funcao = Funcao.new(funcao_params)

    respond_to do |format|
      if @funcao.save

UPDATE `funcaos` SET `cargo` = 'atendente', `updated_at` = '2016-05-21 11:13:44' WHERE `funcaos`.`id` = 2
---
  def update
    respond_to do |format|
      if @funcao.update(funcao_params)

SELECT  `funcaos`.* FROM `funcaos` WHERE `funcaos`.`id` = 2 LIMIT 1
---
    def set_funcao
      @funcao = Funcao.find(params[:id])