app/controllers/turmas_controller.rb

  def index
    @turmas = Turma.all
---
SELECT `turmas`.* FROM `turmas`

  def create
    @turma = Turma.new(turma_params)

    respond_to do |format|
      if @turma.save
---
INSERT INTO `turmas` (`codigo`, `turno`, `semestre`, `disciplina_id`, `capacidade`, `aluno_id`, `created_at`, `updated_at`) VALUES ('TI200', 'Manha', '2016.1', 1, 30, 1, '2016-05-21 12:44:52', '2016-05-21 12:44:52')

  def update
    respond_to do |format|
      if @turma.update(turma_params)
---
UPDATE `turmas` SET `codigo` = 'TI200', `updated_at` = '2016-05-21 19:41:07' WHERE `turmas`.`id` = 1

  def destroy
    @turma.destroy
---
DELETE FROM `turmas` WHERE `turmas`.`id` = 1

    def set_turma
      @turma = Turma.find(params[:id])
---
SELECT  `turmas`.* FROM `turmas` WHERE `turmas`.`id` = 1 LIMIT 1