app/controllers/users_controller.rb

  def index
    @users = User.all.page(params['page']).per(5)
---
SELECT `users`.* FROM `users`

    def set_user
     authorize @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1