app/views/funcionarios/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select :user_id, User.all, :id, :email, prompt: true, :class => 'form-control' %>
---
SELECT `users`.* FROM `users`

    <div class="col-lg-10">
      <%= f.collection_select :funcao_id, Funcao.all, :id, :cargo, prompt: true, :class => 'form-control' %>
---
SELECT `funcaos`.* FROM `funcaos`